Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: རྫུ་འཕྲུལ་གྱི་མཐུ་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མཐུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་འོངས་ཏེ་ཕྱིན་ནས།
en: arrived before the Blessed One through his great miraculous power and the great power of the bodhisattvas.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་ནས།
en: The bodhisattvas bowed to the Blessed One’s feet, sat down before him,

source: བཅོམ་ལྡན་འདས་ལ་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: Sarva­nīvaraṇa­viṣkam­bhin then spoke the following verses in praise of the Blessed One’s qualities:

source: གྲགས་ཆེན་ཤེས་རབ་ཆེན་པོ་པ། །ཐུབ་ཆེན་དཔའ་བོ་ཆེན་པོ་པ། །
en: “Greatly famed and of great insight, You are the great capable one, the great hero,

source: སྲིད་པའི་མྱ་ངན་རྒལ་བ་པོ། །ཉོན་མོངས་རྒལ་ལ་ཕྱག་འཚལ་ལོ། །
en: The one who has gone beyond the pains of existence. You who have gone beyond the afflictions—homage to you!

source: ཐམས་ཅད་དུ་ཡང་ཐ་ལེ་སྟེ། །ཀུན་ནས་རབ་ཏུ་ལྷན་ནེར་བཞུགས། །
en: “Open and direct in all regards, You reside so perfectly pristine,

source: ཀུན་ནས་རྣམ་པར་གྲོལ་བ་པོ། །ཕྱག་འཚལ་མི་མཚུངས་མཚུངས་མེད་ལ། །
en: Completely liberated in every way— Homage to you who are incomparable and unequaled!

source: རབ་ཏུ་མི་སྒུལ་རི་བོ་བཞིན། །གཏིང་ཚོད་ཡངས་པ་རྒྱ་མཚོ་འདྲ། །
en: “Utterly immutable, you resemble a mountain; Deep and wide, you are like the sea.

source: མུ་སྟེགས་ཀུན་ནས་མི་བསྐྱོད་པ། །ཆོས་རྒྱལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Unshakable in the face of the non-Buddhists, You are the King of Dharma—homage to you!

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ན། །གཟོད་ནས་ཞི་ཞིང་མ་སྐྱེས་པ། །
en: “When turning the wheel of Dharma,

source: རང་བཞིན་མྱ་ངན་འདས་པ་ཡི། །ཆོས་རྣམས་མགོན་པོ་ཁྱོད་ཀྱིས་བསྟན། །
en: Instead they will increase, enrich, and expand those virtuous factors that are conducive to the transcendence of suffering,

source: ལ་ལ་ལ་ནི་ལམ་ཡང་བསྟན། །ལ་ལ་ཡང་དག་ཉིད་ལ་བཀོད། །
en: “Some you teach the path, Others you establish within the real;

source: ལ་ལ་ཡང་དག་མྱ་ངན་བཟླས། །ལ་ལ་བྱང་ཆུབ་ལུང་ཡང་བསྟན། །
en: Some you deliver beyond suffering, And for others you prophesy awakening.

source: བག་ལ་ཉལ་དང་བསམ་པ་མཁྱེན། །ཁྱོད་ཀྱིས་མི་མཁྱེན་ཅི་ཡང་མེད། །
en: “Knowing all latencies and inclinations, There is nothing you are not aware of.

source: དེ་ཕྱིར་འདུལ་བའི་བྱ་བ་རྣམས། །གཟིགས་པས་ཁྱོད་ཀྱི་བཀའ་འགྲུབ་བོ། །
en: Thus, as you perceive the ways of training, Your command will be carried out.

source: བྱང་ཆུབ་སྙིང་པོར་བཞུགས་པ་ན། །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་དང་། །
en: “When you sat upon the seat of awakening, Desire, anger, and dullness,

source: དྲི་མ་སྣ་ཚོགས་གཞན་རྣམས་ཀྱང་། །ཁྱོད་ཀྱི་ཡེ་ཤེས་མེ་ཡིས་བསྲེགས། །
en: Along with every other stain, Were consumed by the fire of your wisdom.

source: རྒལ་ནས་སེམས་ཅན་རྣམས་སྒྲོལ་ཞིང་། །གྲོལ་ནས་སྐྱེ་དགུ་གྲོལ་མཛད་དེ། །
en: “Yourself beyond, you liberate sentient beings, And while free yourself, you liberate beings.

source: སྲིད་པའི་མྱ་ངན་འཁྱམས་པ་ཡི། །འཇིག་རྟེན་ཚོལ་བ་ཁྱོད་ལགས་སོ། །
en: You are the one who cares for the world As it roams through the realms of pain.

source: སྲིད་པའི་བཙོན་རར་སེམས་ཅན་དག །ཡུན་རིང་མི་ཤེས་གཉིད་ལོག་རྣམས། །
en: “Sentient beings within the prison of existence Have for long been asleep in their ignorance.

source: སད་པར་མཛད་པ་མགོན་པོ་ཁྱོད། །གཉེན་གྱུར་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Yet you, Protector, awaken them. Homage to you, the friend of beings.

source: ཁྱོད་ཀྱི་སྲས་མཆོག་འདི་དག་ཀྱང་། །ཐམས་ཅད་བྱང་ཆུབ་སླད་དུ་ཞུགས། །
en: “All these supreme children of yours Have set out in pursuit of awakening.

source: དམ་པའི་ཆོས་ནི་ཉན་འཚལ་ན། །འདྲེན་པས་དེ་དག་བསྟན་དུ་གསོལ། །
en: As they wish to the hear the sacred Dharma, I request, O Guide, that you teach them.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་ནས།
en: When the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin had praised the Blessed One in these appropriate verses,

source: བཅོམ་ལྡན་འདས་ཀྱིས་གནང་སྟེ་པད་མའི་སྙིང་པོ་ལ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: the Blessed One directed the bodhisattva to sit down on a lotus flower to the side.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་གནང་ནས་པད་མའི་སྙིང་པོ་ལ་སོ་སོ་ཅི་རིགས་པར་འཁོད་དོ།
en: Likewise, with the Blessed One’s permission the other bodhisattvas each took a seat on their own lotus flower.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་སྟན་ལས་ལངས་ཏེ།
en: The bodhisattva Sarva­nīvaraṇa­viṣkam­bhin now rose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་པད་མའི་སྙིང་པོ་ལ་བཙུགས་ཏེ།
en: draped his shawl over one shoulder, and knelt with his right knee on the lotus flower.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Joining his palms, he bowed toward the Blessed One and said,

source: གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན།
en: “If the Blessed One would grant me the opportunity to ask them and hear his answers,

source: བདག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཕྱོགས་འགའ་ཞིག་ཞུའོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: I have a few questions that I would like to bring before the Blessed One, the thus-gone, worthy, perfect Buddha.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Replying to the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin, the Blessed One said,

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ལ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་རྟག་ཏུ་སྐབས་ཕྱེས།
en: “Holy being, all thus-gone ones will always grant you the opportunity to speak.

source: དེ་བཞིན་གཤེགས་པ་ལ་ཁྱོད་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་།
en: You may ask the Thus-Gone One whatever you wish.

source: དྲིས་པ་ལུང་བསྟན་པ་དེ་དང་དེ་ཉིད་ཀྱིས་ངས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ།
en: I shall then satisfy your mind with a teaching.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྐབས་ཕྱེ་བ་དང་། བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: With the Blessed One’s permission, the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin then asked,

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ལགས།
en: “Blessed One, what are the bodhisattva great beings’ perfections of generosity like?

source: ཇི་ལྟར་ན་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ལགས།
en: How are their perfections of discipline?

source: ཇི་ལྟར་ན་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ལགས།
en: How are their perfections of patience?

source: ཇི་ལྟར་ན་བརྩོན་འགྲུས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ལགས།
en: How are their perfections of diligence?

source: ཇི་ལྟར་ན་བསམ་གཏན་ཕུན་སུམ་ཚོགས་པ་རྣམས་ལགས།
en: How are their perfections of concentration?

source: ཇི་ལྟར་ན་ཤེས་རབ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ལགས།
en: How are their perfections of insight?

source: ཇི་ལྟར་ན་ཐབས་མཁས་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ལགས།
en: How are their perfections of skillful means?

source: ཇི་ལྟར་ན་སྨོན་ལམ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ལགས།
en: How are their perfections of aspirations?

source: ཇི་ལྟར་ན་སྟོབས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ལགས།
en: How are their perfections of power?

source: ཇི་ལྟར་ན་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ལགས།
en: How are their perfections of wisdom?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ས་དང་མཚུངས་པ་རྣམས་ལགས། ཇི་ལྟར་ན་ཆུ་དང་མཚུངས་པ་རྣམས་ལགས། ཇི་ལྟར་ན་མེ་དང་མཚུངས་པ་རྣམས་ལགས། ཇི་ལྟར་ན་རླུང་མར་དང་མཚུངས་པ་རྣམས་ལགས། ཇི་ལྟར་ན་ནམ་མཁའ་དང་མཚུངས་པ་རྣམས་ལགས།
en: “Blessed One, how are bodhisattvas similar to the earth? How are they similar to water? How are they similar to fire? How are they similar to wind? How are they similar to space?

source: ཇི་ལྟར་ན་ཟླ་བ་ལྟ་བུ་རྣམས་ལགས། ཇི་ལྟར་ན་ཉི་མ་ལྟ་བུ་རྣམས་ལགས།
en: How are they like the moon? How are they like the sun?

source: ཇི་ལྟར་ན་སེང་གེ་ལྟ་བུ་རྣམས་ལགས།
en: How do they resemble lions?

source: ཇི་ལྟར་ན་དུལ་བ་རྣམས་ལགས།
en: How are the bodhisattvas who have trained well?

source: ཇི་ལྟར་ན་ཅང་ཤེས་པ་རྣམས་ལགས།
en: How are those who are of noble birth?

source: ཇི་ལྟར་ན་པད་མ་ལྟ་བུ་རྣམས་ལགས།
en: How are the ones who resemble lotuses?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་རྒྱ་ཆེ་བ་རྣམས་ལགས། ཇི་ལྟར་ན་སེམས་རྣམ་པར་དག་པ་རྣམས་ལགས། ཇི་ལྟར་ན་སེམས་ནེམ་ནུར་མ་མཆིས་པ་རྣམས་ལགས།
en: “Blessed One, how are the vast bodhisattvas, how are those with pure mind, and how are those who are free of doubt?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བློ་རྒྱ་མཚོ་ལྟ་བུ་རྣམས་ལགས། ཇི་ལྟར་ན་བློ་ཞིབ་པ་རྣམས་ལགས།
en: Blessed One, how are the bodhisattvas whose minds are like the ocean, and how are those of subtle intellect?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རིགས་པའི་སྤོབས་པ་ཅན་རྣམས་ལགས། ཇི་ལྟར་ན་གྲོལ་བའི་སྤོབས་པ་ཅན་རྣམས་ལགས། ཇི་ལྟར་ན་རྣམ་པར་དག་པའི་སྤོབས་པ་ཅན་རྣམས་ལགས། ཇི་ལྟར་ན་སེམས་ཅན་ཐམས་ཅད་མགུ་བར་བྱེད་པའི་སྤོབས་པ་ཅན་རྣམས་ལགས།
en: Blessed One, how do bodhisattvas have coherent eloquence, how do they have fluent eloquence, how do they have pure eloquence, and how do they have eloquence that makes everyone happy?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚིག་གཟུང་བ་རྣམས་ལགས།
en: Blessed One, how are bodhisattvas’ words to be accepted?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བརྗོད་པ་རྣམས་ལགས། ཇི་ལྟར་ན་ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་རྣམས་ལགས། ཇི་ལྟར་ན་ཆོས་ཀྱི་དབྱིངས་ལ་མཁས་པ་རྣམས་ལགས།
en: Blessed One, how do bodhisattvas express the Dharma, how do they follow the Dharma, and how do they become experts with respect to the realm of phenomena?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་སྤྱོད་ཡུལ་བ་རྣམས་ལགས། ཇི་ལྟར་ན་མཚན་མ་མེད་པ་ལ་གནས་པ་རྣམས་ལགས། ཇི་ལྟར་ན་སྨོན་ལམ་ལ་གནས་པ་ཐམས་ཅད་དང་བྲལ་བ་རྣམས་ལགས།
en: Blessed One, how do bodhisattvas experience emptiness, how do they abide within the absence of marks, and how are they free from any fixation on their aspirations?

source: ཇི་ལྟར་ན་བྱམས་པའི་བདག་ཉིད་ཅན་རྣམས་ལགས། ཇི་ལྟར་ན་སྙིང་རྗེའི་བདག་ཉིད་ཅན་རྣམས་ལགས།
en: How do they have a loving nature, and how do they have a compassionate nature?

source: ཇི་ལྟར་ན་དགའ་བ་ལ་གནས་པ་རྣམས་ལགས། ཇི་ལྟར་ན་བཏང་སྙོམས་ལ་གནས་པ་རྣམས་ལགས།
en: How are they joyful, and how do they rest in equanimity?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་ཤེས་པས་རྣམ་པར་རོལ་པ་རྣམས་ལགས།
en: “Blessed One, how do bodhisattvas revel in superknowledge,

source: ཇི་ལྟར་ན་མི་ཁོམ་པ་བརྒྱད་རྣམ་པར་སྤངས་པ་རྣམས་ལགས།
en: how do they relinquish the eight unfree states,

source: ཇི་ལྟར་ན་བྱང་ཆུབ་ཀྱི་སེམས་མ་སྟོར་བ་རྣམས་ལགས།
en: how do they ensure that the mind of awakening is not lost,

source: ཇི་ལྟར་ན་སྐྱེ་བ་དྲན་པ་རྣམས་ལགས།
en: how do they recollect former lives,

source: ཇི་ལྟར་ན་དགེ་བའི་བཤེས་གཉེན་དང་མ་བྲལ་བ་རྣམས་ལགས།
en: how do they not separate from their spiritual teachers,

source: ཇི་ལྟར་ན་སྡིག་པའི་གྲོགས་པོ་ཡོངས་སུ་སྤངས་པ་རྣམས་ལགས།
en: and how do they give up unwholesome company?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཆོས་ཉིད་འཐོབ་པར་འགྱུར།
en: Blessed One, how do bodhisattvas attain the intrinsic nature of the thus-gone ones’ body?

source: ཇི་ལྟར་ན་ལུས་རྡོ་རྗེ་ལྟར་སྲ་བ་རྣམས་ལགས།
en: In what way is their body solid like a vajra?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་ཆེན་པོ་རྣམས་ལགས། ཇི་ལྟར་ན་ལམ་ལ་མཁས་པ་རྣམས་ལགས། ཇི་ལྟར་ན་ལམ་མ་ལོག་པར་སྟོན་པ་རྣམས་ལགས།
en: Blessed One, in what sense are bodhisattvas great caravan leaders, how are they experts concerning the path, and in what way do they point out the unmistaken path?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་སེམས་མཉམ་པར་བཞག་པ་རྣམས་ལགས།
en: Blessed One, how do bodhisattvas remain constantly in equipoise, without any interruption?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཕྱག་དར་ཁྲོད་པ་རྣམས་ལགས། ཇི་ལྟར་ན་ཆོས་གོས་གསུམ་པ་རྣམས་ལགས། ཇི་ལྟར་ན་ཕྱིང་པ་ཅན་རྣམས་ལགས།
en: “Blessed One, who are the bodhisattvas who wear refuse rags, who wear the three Dharma robes, and who wear felt?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསོད་སྙོམས་པ་རྣམས་ལགས། ཇི་ལྟར་ན་སྟན་གཅིག་པ་རྣམས་ལགས། ཇི་ལྟར་ན་ཟས་ཕྱིས་མི་ལེན་པ་རྣམས་ལགས།
en: Blessed One, how do bodhisattvas live as mendicants, how do they remain on a single seat, and how do they abstain from late meals?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དགོན་པ་པ་རྣམས་ལགས།
en: Blessed One, who are the bodhisattvas who remain in hermitages,

source: ཇི་ལྟར་ན་ཤིང་དྲུང་པ་རྣམས་ལགས།
en: who are the ones who remain at the foot of a tree,

source: ཇི་ལྟར་ན་བླ་གབ་མེད་པ་པ་རྣམས་ལགས།
en: who are the shelterless ones,

source: ཇི་ལྟར་ན་དུར་ཁྲོད་པ་རྣམས་ལགས།
en: who are the charnel ground dwellers,

source: ཇི་ལྟར་ན་ཅོག་པུ་པ་རྣམས་ལགས།
en: who are the tent dwellers,

source: ཇི་ལྟར་ན་གཞི་ཇི་བཞིན་པ་རྣམས་ལགས།
en: who are the ones who stay just where they are?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣལ་འབྱོར་སྤྱོད་པ་རྣམས་ལགས།
en: Blessed One, who are those bodhisattvas engaged in practice,

source: ཇི་ལྟར་ན་མདོ་སྡེ་འཛིན་པ་རྣམས་ལགས།
en: who are the specialists in the discourses,

source: ཇི་ལྟར་ན་འདུལ་བ་འཛིན་པ་རྣམས་ལགས།
en: who are the specialists in the discipline,

source: ཇི་ལྟར་ན་མ་མོ་འཛིན་པ་རྣམས་ལགས།
en: who are the specialists in the lists?

source: ཇི་ལྟར་ན་ཆོ་ག་དང་། སྤྱོད་ཡུལ་དང་། སྤྱོད་པ་དང་། སྤྱོད་ལམ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ལགས།
en: “How are they perfect in conduct, personal associations, behavior, and deportment?

source: ཇི་ལྟར་ན་སེར་སྣ་དང་། ཕྲག་དོག་དང་བྲལ་བ་རྣམས་ལགས།
en: How are bodhisattvas free from stinginess and envy?

source: ཇི་ལྟར་ན་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ་རྣམས་ལགས།
en: How do they have equal concern for all sentient beings?

source: ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་རིམ་གྲོ་བགྱིད་མཁས་པ་རྣམས་ལགས།
en: How are they skilled in worshiping and venerating the thus-gone ones?

source: ཇི་ལྟར་ན་ང་རྒྱལ་བཅོམ་པ་རྣམས་ལགས། ཇི་ལྟར་ན་དད་པ་མང་བ་རྣམས་ལགས།
en: Who are the ones who crush pride, and who are the ones with abundant faith?

source: ཇི་ལྟར་ན་ཀུན་རྫོབ་ལ་མཁས་པ་རྣམས་ལགས། ཇི་ལྟར་ན་དོན་དམ་པ་ལ་མཁས་པ་རྣམས་ལགས།
en: How are they experts concerning the relative? How are they experts concerning the ultimate?

source: ཇི་ལྟར་ན་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མཁས་པ་རྣམས་ལགས།
en: How are they experts concerning dependent origination?

source: ཇི་ལྟར་ན་བདག་ཤེས་པ་རྣམས་ལགས། ཇི་ལྟར་ན་འཇིག་རྟེན་ཤེས་པ་རྣམས་ལགས།
en: How do they have knowledge of themselves? What does their knowledge of the world consist of?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་སྐྱེ།
en: Blessed One, how do bodhisattvas take birth in pure buddha realms?

source: ཇི་ལྟར་ན་མངལ་གྱི་དྲི་མས་མ་གོས་པར་སྐྱེ།
en: How do they take birth free from any stain of the womb?

source: ཇི་ལྟར་ན་ཁྱིམ་གྱི་གནས་ནས་མངོན་པར་བྱུང་བ་རྣམས་ལགས།
en: How do they renounce the household life?

source: ཇི་ལྟར་ན་འཚོ་བ་ཡོངས་སུ་དག་པ་རྣམས་ལགས།
en: What does their pure livelihood consist of?

source: ཇི་ལྟར་ན་ཡིད་ཡོངས་སུ་མི་སྐྱོ་བ་རྣམས་ལགས།
en: How do they steer clear of weariness?

source: ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བཀའ་བཞིན་བགྱིད་པ་རྣམས་ལགས།
en: How do they act according to the teaching of the thus-gone ones?

source: ཇི་ལྟར་ན་བཞིན་འཛུམ་ཞིང་ཁྲོ་གཉེར་མ་མཆིས་པ་རྣམས་ལགས།
en: How do they keep their smiling face free from frowns of anger?

source: ཇི་ལྟར་ན་མང་དུ་ཐོས་པ་རྣམས་ལགས།
en: Who are the bodhisattvas who have received abundant teachings?

source: ཇི་ལྟར་ན་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་རྣམས་ལགས།
en: Who are those who uphold the sacred Dharma?

source: ཇི་ལྟར་ན་ཆོས་ཀྱི་རྒྱལ་པོའི་སྲས་རྣམས་ལགས།
en: In what way are bodhisattvas heirs of the King of Dharma?

source: ཇི་ལྟར་ན་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་བས་བསྩུ་བ་རྣམས་ལགས།
en: How do Śakra, Brahmā, and the guardians of the world welcome them?

source: ཇི་ལྟར་ན་བསམ་པ་དང་། བག་ལ་ཉལ་འཚལ་བ་རྣམས་ལགས།
en: How do they know intentions and latent tendencies?

source: ཇི་ལྟར་ན་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་ཆོ་ག་འཚལ་བ་རྣམས་ལགས།
en: How do they pursue the ways for maturing sentient beings?

source: ཇི་ལྟར་ན་དེས་པ་རྣམས་ལགས།
en: In what way are they upright?

source: ཇི་ལྟར་ན་འགྲོགས་ན་བདེ་བ་རྣམས་ལགས།
en: How are they delightful to accompany?

source: ཇི་ལྟར་ན་བསྡུ་བའི་དངོས་པོ་ལ་མཁས་པ་རྣམས་ལགས།
en: What is their skill with respect to the means of attraction?

source: ཇི་ལྟར་ན་ཚུལ་དུ་ཤིས་པ་རྣམས་ལགས།
en: In what way are they pleasing?

source: ཇི་ལྟར་ན་གནས་བཅའ་བ་རྣམས་ལགས།
en: How do they provide support?

source: ཇི་ལྟར་ན་རྩིའི་རྒྱལ་པོའི་ཤིང་ཆེན་པོ་ལྟ་བུ་རྣམས་ལགས།
en: In what way are they like the king of medicinal trees?

source: ཇི་ལྟར་ན་བསོད་ནམས་བགྱི་བ་ལ་བརྩོན་པ་རྣམས་ལགས།
en: How do they pursue meritorious deeds?

source: ཇི་ལྟར་ན་སྤྲུལ་པ་ལ་མཁས་པ་རྣམས་ལགས།
en: What does their expertise regarding emanations consist of?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དག་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Blessed One, how do bodhisattvas quickly and fully awaken to unexcelled and perfect buddhahood?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: In reply to the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin, the Blessed One said,

source: རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །ཡང་རིགས་ཀྱི་བུ་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་།
en: “Noble son, excellent, excellent. Noble son, you have asked in this manner to benefit many beings and to bring them happiness.

source: འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། ཕན་པ་དང་བདེ་བའི་ཕྱིར་ཞུགས་ཤིང་།
en: You have great compassion that loves the world and seeks to benefit ordinary beings—gods and humans alike—by accomplishing their welfare and happiness.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ལ་ཁྱོད་འདི་ལྟ་བུའི་དོན་འདྲི་བར་སེམས་པ་ལེགས་སོ།
en: Your intention for having asked the Thus-Gone One such questions is excellent.

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ལེགས་པར་ཤིན་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་དོ།
en: Therefore, noble son, I will answer you, so listen well and keep what I say in mind.”

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་པ་དང་།
en: “Excellent, Blessed One!” replied the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin, and he listened as instructed.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then said,

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ། །བཅུ་གང་ཞེ་ན།
en: “Noble son, bodhisattvas who practice perfect generosity possess ten qualities. What are those ten?

source: འདི་ལྟ་སྟེ། ཆོས་ཀྱི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། མི་འཇིགས་པའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། ཟང་ཟིང་གི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། ལན་དུ་ཕན་འདོགས་པ་ལ་མི་རེ་བའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། སྙིང་རྗེ་བའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། མི་བརྙས་པའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། བསྟི་སྟང་གི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། མཆོད་པ་དང་རིམ་གྲོའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། མི་གནས་པའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། ཡོངས་སུ་དག་པའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: They are the perfect giving of the Dharma, the perfect giving of fearlessness, the perfect giving of material things, the perfect giving free of expectation of a reward, the perfect giving of compassion, the perfect giving free of disdain, the perfect giving of respect, the perfect giving of reverence and worship, the perfect open-ended giving, and the perfectly pure giving.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder what the bodhisattvas’ perfect giving of the Dharma consists in.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཟང་ཟིང་མེད་པའི་སེམས་ཀྱིས་ཆོས་རྣམས་འཛིན་ཅིང་ཀུན་ཆུབ་པར་བྱེད་དེ།
en: Noble son, it consists in the bodhisattvas’ making others retain and understand the teachings without any concern for material things.

source: རྙེད་པ་དང་བཀུར་སྟིའི་ཕྱིར་མ་ཡིན། ཤེས་ཀྱི་ཁེ་འདོད་པའི་ཕྱིར་མ་ཡིན། གྲགས་པ་འདོད་པའི་ཕྱིར་མ་ཡིན་ཏེ།
en: This is not done for the sake of wealth or respect, or with a wish for mundane gain, or with a wish for fame.

source: གཞན་དུ་ན་དེ་འདི་ལྟར་སེམས་ཅན་འདི་དག་གི་སྡུག་བསྔལ་ཐམས་ཅད་ཇི་ལྟར་ཟད་པར་བྱ་སྙམ་སྟེ།
en: Rather, they think, ‘How can I bring an end to all the sufferings of these beings?’

source: ཆོས་དེ་དག་ཀྱང་ཟང་ཟིང་མེད་པའི་སེམས་ཀྱིས་
en: In this way, without any concern for material things,

source: གཉིས་སུ་མེད་པར་གཞན་དག་ལ་ཡང་ཡང་དག་པར་སྟོན་ཏོ། །
en: they explain the teachings to others in a way that is genuine and beyond duality.

source: ཇི་ལྟར་རྒྱལ་པོའམ་བློན་པོ་ཆེན་པོ་ལ་ཡང་དག་པར་སྟོན་པ་དེ་ལྟར་གདོལ་པའམ། གདོལ་བུ་ལ་ཡང་ཡང་དག་པར་སྟོན་ན།
en: Just as they teach kings and great ministers thoroughly, so also do they genuinely teach outcasts and their offspring.

source: དེ་མ་ཡིན་པ་གྲོང་པ་དང་། ཡུལ་གྱི་མི་གཞན་དག་ལ་ལྟ་ཅི་སྨོས།
en: Needless to mention that they also do so for the inhabitants of foreign cities and lands.

source: ཆོས་ཀྱི་སྦྱིན་པ་དེས་ཁེངས་པར་ཡང་མི་འགྱུར་ཏེ།
en: Through this giving of the Dharma they do not become arrogant.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Noble son, such is the bodhisattvas’ perfect giving of the Dharma.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་འཇིགས་པའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “Next, what is the bodhisattvas’ perfect giving of fearlessness?

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བདག་གིས་དབྱིག་པ་བོར་བ་དང་། མཚོན་ཆ་བོར་བ་ཡིན་ཏེ། གཞན་དག་ཀྱང་བསླབ་པ་དེ་ཉིད་ལ་གཞོག་གོ།
en: Noble son, bodhisattvas personally give up sticks and weapons, and instruct others in that practice.

source: དེ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕར་འདུ་ཤེས་པ་ཡིན། མར་འདུ་ཤེས་པ་ཡིན། བུར་འདུ་ཤེས་པ་ཡིན། གཉེན་བཤེས་སུ་འདུ་ཤེས་པ་ཡིན། ཉེ་དུའམ་སྣག་གི་གཉེན་མཚམས་དག་ཀྱང་རུང་བར་འདུ་ཤེས་པ་ཡིན་ནོ།
en: They consider all beings to be like their fathers, mothers, children, friends, relatives, or kinsmen.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་བཞིན་གཤེགས་པས་ཀྱང་
en: How so? They recollect that the Thus-Gone One has taught,

source: སྐྱེ་བ་འཕོ་བ་དེ་དང་དེ་དག་ཏུ་སེམས་ཅན་གྱི་
en: ‘Among all sentient beings there is no one who, throughout all your changing lives,

source: རིས་སུ་གང་ཁྱོད་ཀྱི་ཕའམ། མ་འམ་བུའམ། གཉེན་བཤེས་སམ། ཉེ་དུའམ། སྣག་གི་གཉེན་མཚམས་དག་གང་ཡང་རུང་བའི་གནས་སུ་མ་གྱུར་པའི་སེམས་ཅན་དེ་ལྟ་བུ་མེད་དོ་ཞེས་གསུངས་སོ་
en: has not at some point been your father, mother, child, friend, relative, or kinsman.’

source: སྙམ་ནས། དེ་སྲོག་ཆགས་སུ་གྱུར་པ་ཕྲ་མོའི་ཕྱིར་ཡང་བདག་གི་ཤ་དག་གིས་ཀྱང་ཕན་འདོགས་ན།
en: With that in mind they feel that they ought to provide for even subtle forms of life by means of their own flesh,

source: སྲོག་ཆགས་ཆེན་པོ་ཆེ་བ་གཞན་དག་ལ་ལྟ་ཅི་སྨོས་ཏེ།
en: and so it goes without saying that they must also act in the same way toward larger creatures.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་འཇིགས་པ་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ perfect giving of fearlessness.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཟང་ཟིང་གི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What is the bodhisattvas’ perfect giving of material things?

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གང་དག་མི་དགེ་བའི་ལས་རབ་ཏུ་བྱེད་པ་མཐོང་ན། དེ་དག་ཟང་ཟིང་གིས་སྡུད་ཅིང་།
en: Noble son, when bodhisattvas see sentient beings engaged in unvirtuous activity they attract them with material things.

source: ཟང་ཟིང་གིས་བསྡུས་ནས་
en: By thus attracting them with material things,

source: མི་དགེ་བའི་གནས་དེ་ནས་བསླང་སྟེ། དགེ་བའི་གནས་སུ་འགོད་དོ།
en: they deliver those beings out of their unvirtuous ways and establish them in goodness.

source: དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་
en: They think to themselves, ‘The Blessed One has taught,

source: སྦྱིན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་བོ།
en: “Generosity is the bodhisattva’s awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་སྦྱིན་པ་ན་མི་དགེ་བའི་ཆོས་ཕྲག་དོག་དང་། སེར་སྣ་དང་། ངན་སེམས་གསུམ་སྤངས་པ་ཡིན་ནོ་ཞེས་གསུངས་ཏེ།
en: A bodhisattva’s generosity is free of the three unvirtuous qualities of envy, stinginess, and malice.”

source: དེ་བས་ན་བདག་གིས་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་བསླབ་ཅིང་སྦྱིན་པ་སྦྱིན་པར་བྱའོ་སྙམ་སྟེ།
en: Therefore, I too shall follow the Thus-Gone One and practice generosity.’

source: དེ་སྦྱིན་པ་ཡང་སྦྱིན་ཞིང་སྦྱིན་པ་དེས་ཁེངས་པར་ཡང་མི་འགྱུར་ཏེ
en: Then, as they engage in generous practices, their generosity does not make them conceited.
